In [3]:
import numpy as np
import pandas as pd

In [6]:
df = pd.read_csv("Resources/tips.csv")

In [7]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [8]:
def last_numbers(num, count):
    return str(num)[-count:]
def last_four(num):
    return str(num)[-4:]

In [9]:
last_numbers(121244, 4)

'1244'

In [10]:
df["CC Number"].apply(last_four)

0      3410
1      9230
2      1322
3      5994
4      7221
       ...
239    2842
240    5404
241    7196
242    0950
243    8139
Name: CC Number, Length: 244, dtype: object

In [11]:
df["total_bill"].mean()

19.78594262295082

In [12]:
def yelp(price):
    if price < 10:
        return "$"
    elif price >= 10 and price < 30:
        return "$$"
    else:
        return "$$$"

In [13]:
df["yelp"] = df["total_bill"].apply(yelp)

In [14]:
df["yelp"]

0      $$
1      $$
2      $$
3      $$
4      $$
       ..
239    $$
240    $$
241    $$
242    $$
243    $$
Name: yelp, Length: 244, dtype: object

In [15]:
def one_prsn(total, size):
    return total/size

In [20]:
df["total_bill"].apply(lambda num: num * 2)

0      33.98
1      20.68
2      42.02
3      47.36
4      49.18
       ...
239    58.06
240    54.36
241    45.34
242    35.64
243    37.56
Name: total_bill, Length: 244, dtype: float64

In [21]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,yelp
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,$$
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,$$
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,$$
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,$$
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,$$

In [24]:
def quality(total_bill, tip):
    return "Щедрые чаевые" if tip/total_bill > 0.25 else "Обычные чаевые"

In [27]:
quality(16.99, 1.01)

'Обычные чаевые'

In [33]:
df["quality"] = df[["total_bill", "tip"]].apply(lambda filtered_df: quality(filtered_df["total_bill"], filtered_df["tip"]), axis = 1)

In [34]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,yelp,quality
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,$$,Обычные чаевые
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,$$,Обычные чаевые
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,$$,Обычные чаевые
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,$$,Обычные чаевые
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,$$,Обычные чаевые
...,...,...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657,$$,Обычные чаевые
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766,$$,Обычные чаевые
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880,$$,Обычные чаевые
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17,$$,Обычные чаевые
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672,$$,Обычные чаевые

In [36]:
np.vectorize(quality)(df["total_bill"], df["tip"])

array(['Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Щедрые чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Щедрые чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Щедрые чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Щедрые чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Щедрые чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Щедрые чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Щедрые чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Щедрые чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Щедрые чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Щедрые чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые', 'Обычные чаевые', 'Обычные чаевые',
       'Обычные чаевые'], dtype='<U14')

In [4]:
df = pd.read_csv("Resources/tips.csv")

In [7]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
total_bill,244.0,1.978594e+01,8.902412e+00,3.070000e+00,1.334750e+01,1.779500e+01,2.412750e+01,5.081000e+01
tip,244.0,2.998279e+00,1.383638e+00,1.000000e+00,2.000000e+00,2.900000e+00,3.562500e+00,1.000000e+01
size,244.0,2.569672e+00,9.510998e-01,1.000000e+00,2.000000e+00,2.000000e+00,3.000000e+00,6.000000e+00
price_per_person,244.0,7.888197e+00,2.914234e+00,2.880000e+00,5.800000e+00,7.255000e+00,9.390000e+00,2.027000e+01
CC Number,244.0,2.563496e+15,2.369340e+15,6.040679e+10,3.040731e+13,3.525318e+15,4.553675e+15,6.596454e+15

In [12]:
df.sort_values(["tip", "size"],ascending=True)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
67,3.07,1.00,Female,Yes,Sat,Dinner,1,3.07,Tiffany Brock,4359488526995267,Sat3455
111,7.25,1.00,Female,No,Sat,Dinner,1,7.25,Terri Jones,3559221007826887,Sat4801
92,5.75,1.00,Female,Yes,Fri,Dinner,2,2.88,Leah Ramirez,3508911676966392,Fri3780
236,12.60,1.00,Male,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
...,...,...,...,...,...,...,...,...,...,...,...
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954

In [17]:
df["total_bill"].idxmax()

170

In [18]:
df.iloc[170]

total_bill                     50.81
tip                             10.0
sex                             Male
smoker                           Yes
day                              Sat
time                          Dinner
size                               3
price_per_person               16.94
Payer Name             Gregory Clark
CC Number           5473850968388236
Payment ID                   Sat1954
Name: 170, dtype: object

In [27]:
df.corr(numeric_only=True)

                  total_bill       tip      size  price_per_person  CC Number
total_bill          1.000000  0.675734  0.598315          0.647554   0.104576
tip                 0.675734  1.000000  0.489299          0.347405   0.110857
size                0.598315  0.489299  1.000000         -0.175359  -0.030239
price_per_person    0.647554  0.347405 -0.175359          1.000000   0.135240
CC Number           0.104576  0.110857 -0.030239          0.135240   1.000000

In [28]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [30]:
df["sex"].value_counts()

sex
Male      157
Female     87
Name: count, dtype: int64

In [35]:
df["day"].nunique()

4

In [37]:
df["day"].value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [38]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [40]:
df["sex"].replace(to_replace = ["Male", "Female"], value = ["M", "F"])

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

In [48]:
mymap = {"Female": "F", "Male": "M"}

def myfunc(sex):
    return sex[0]

In [47]:
df["sex"].map(myfunc)

0      Fe
1      Ma
2      Ma
3      Ma
4      Fe
       ..
239    Ma
240    Fe
241    Ma
242    Ma
243    Fe
Name: sex, Length: 244, dtype: object

In [56]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
239    False
240    False
241    False
242    False
243    False
Length: 244, dtype: bool

In [50]:
simple_df = pd.DataFrame([1, 2, 2, 2], ["a", "b", "c", "d"])

In [53]:
simple_df.duplicated()

a    False
b    False
c     True
d     True
dtype: bool

In [54]:
simple_df.drop_duplicates()

   0
a  1
b  2

In [60]:
df[df["total_bill"].between(10, 10.1)]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
82,10.07,1.83,Female,No,Thur,Lunch,1,10.07,Julie Moody,630413282843,Thur4909
226,10.09,2.00,Female,Yes,Fri,Lunch,2,5.04,Ruth Weiss,5268689490381635,Fri6359
235,10.07,1.25,Male,No,Sat,Dinner,2,5.04,Sean Gonzalez,3534021246117605,Sat4615

In [62]:
df.nlargest(10, "tip")

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025
183,23.17,6.50,Male,Yes,Sun,Dinner,4,5.79,Dr. Michael James,4718501859162,Sun6059
214,28.17,6.50,Female,Yes,Sat,Dinner,3,9.39,Marissa Jackson,4922302538691962,Sat3374
47,32.40,6.00,Male,No,Sun,Dinner,4,8.10,James Barnes,3552002592874186,Sun9677
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
88,24.71,5.85,Male,No,Thur,Lunch,2,12.36,Roger Taylor,4410248629955,Thur9003

In [64]:
df.nsmallest(3, "size")

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
67,3.07,1.00,Female,Yes,Sat,Dinner,1,3.07,Tiffany Brock,4359488526995267,Sat3455
82,10.07,1.83,Female,No,Thur,Lunch,1,10.07,Julie Moody,630413282843,Thur4909
111,7.25,1.00,Female,No,Sat,Dinner,1,7.25,Terri Jones,3559221007826887,Sat4801

In [65]:
df.sample(6)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
188,18.15,3.50,Female,Yes,Sun,Dinner,3,6.05,Glenda Wiggins,578329325307,Sun430
169,10.63,2.00,Female,Yes,Sat,Dinner,2,5.32,Amy Hill,3536332481454019,Sat1788
202,13.00,2.00,Female,Yes,Thur,Lunch,2,6.50,Ashley Shaw,180088043008041,Thur1301
110,14.00,3.00,Male,No,Sat,Dinner,2,7.00,James Sanchez,345243048851323,Sat6801
232,11.61,3.39,Male,No,Sat,Dinner,2,5.80,James Taylor,6011482917327995,Sat2124
192,28.44,2.56,Male,Yes,Thur,Lunch,2,14.22,Dr. Jeffrey Rich,4737538358295,Thur4334

In [66]:
df.sample(frac=0.3)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
155,29.85,5.14,Female,No,Sun,Dinner,5,5.97,Madison Wilson,4210875236164664,Sun9176
13,18.43,3.00,Male,No,Sun,Dinner,4,4.61,Joshua Jones,6011163105616890,Sun2971
40,16.04,2.24,Male,No,Sat,Dinner,3,5.35,Adam Edwards,3544447755679420,Sat8549
163,13.81,2.00,Male,No,Sun,Dinner,2,6.90,Charles Newton,5552793481414044,Sun8594
177,14.48,2.00,Male,Yes,Sun,Dinner,2,7.24,John Dudley,4565183162071073,Sun6203
...,...,...,...,...,...,...,...,...,...,...,...
196,10.34,2.00,Male,Yes,Thur,Lunch,2,5.17,Eric Martin,30442491190342,Thur9862
74,14.73,2.20,Female,No,Sat,Dinner,2,7.36,Ashley Harris,501828723483,Sat6548
57,26.41,1.50,Female,No,Sat,Dinner,2,13.20,Melody Simon,4745394421258160,Sat8980
62,11.02,1.98,Male,Yes,Sat,Dinner,2,5.51,Joseph Hart,180046232326178,Sat2265
38,18.69,2.31,Male,No,Sat,Dinner,3,6.23,Brandon Bradley,4427601595688633,Sat4056